Repository: harshchandra1984/wp-oauth2-server
Catalog: hc-oauth2-server/languages/hc-oauth2-server-*.po
Languages: de_de, es_es

source: OAuth2 Server
es_es: Servidor OAuth2

source: Auth Clients
de_de: Authentifizierungs-Clients
es_es: Clientes de Autenticación

source: Auth Tokens
de_de: Authentifizierungs-Tokens
es_es: Tokens de Autenticación

source: Webhook Settings
de_de: Webhook-Einstellungen
es_es: Configuración de Webhooks

source: OAuth2 client has been successfully added.
de_de: Der OAuth2-Client wurde erfolgreich hinzugefügt.
es_es: El cliente OAuth2 se ha agregado correctamente.

source: OAuth2 client has been successfully deleted.
de_de: Der OAuth2-Client wurde erfolgreich gelöscht.
es_es: El cliente OAuth2 se ha eliminado correctamente.

source: Client secret has been successfully regenerated.
de_de: Das Client-Geheimnis wurde erfolgreich neu generiert.
es_es: El secreto del cliente se ha regenerado correctamente.

source: Access token has been successfully revoked.
de_de: Das Zugriffs-Token wurde erfolgreich widerrufen.
es_es: El token de acceso se ha revocado correctamente.

source: Settings have been successfully saved.
de_de: Die Einstellungen wurden erfolgreich gespeichert.
es_es: La configuración se ha guardado correctamente.

source: Error: Missing required fields. Please fill in all required information.
de_de: Fehler: Erforderliche Felder fehlen. Bitte füllen Sie alle erforderlichen Informationen aus.
es_es: Error: Faltan campos requeridos. Por favor, complete toda la información requerida.

source: Error: Failed to add client. Please try again.
de_de: Fehler: Client konnte nicht hinzugefügt werden. Bitte versuchen Sie es erneut.
es_es: Error: No se pudo agregar el cliente. Por favor, intente de nuevo.

source: Error: Failed to delete client. Please try again.
de_de: Fehler: Client konnte nicht gelöscht werden. Bitte versuchen Sie es erneut.
es_es: Error: No se pudo eliminar el cliente. Por favor, intente de nuevo.

source: Error: Failed to regenerate client secret. Please try again.
de_de: Fehler: Client-Geheimnis konnte nicht neu generiert werden. Bitte versuchen Sie es erneut.
es_es: Error: No se pudo regenerar el secreto del cliente. Por favor, intente de nuevo.

source: Error: Failed to revoke token. Please try again.
de_de: Fehler: Token konnte nicht widerrufen werden. Bitte versuchen Sie es erneut.
es_es: Error: No se pudo revocar el token. Por favor, intente de nuevo.

source: Error: Failed to save settings. Please try again.
de_de: Fehler: Einstellungen konnten nicht gespeichert werden. Bitte versuchen Sie es erneut.
es_es: Error: No se pudieron guardar la configuración. Por favor, intente de nuevo.

source: Error: Security check failed. Please try again.
de_de: Fehler: Sicherheitsüberprüfung fehlgeschlagen. Bitte versuchen Sie es erneut.
es_es: Error: La verificación de seguridad falló. Por favor, intente de nuevo.

source: Server Information
de_de: Server-Informationen
es_es: Información del Servidor

source: Authorization Endpoint
de_de: Autorisierungs-Endpunkt
es_es: Endpoint de Autorización

source: Token Endpoint
de_de: Token-Endpunkt
es_es: Endpoint de Token

source: Userinfo Endpoint
de_de: Benutzerinfo-Endpunkt
es_es: Endpoint de Información de Usuario

source: Logout Endpoint
de_de: Abmelde-Endpunkt
es_es: Endpoint de Cierre de Sesión

source: Quick Stats
de_de: Schnellstatistiken
es_es: Estadísticas Rápidas

source: Registered Clients:
de_de: Registrierte Clients:
es_es: Clientes Registrados:

source: Active Tokens:
de_de: Aktive Tokens:
es_es: Tokens Activos:

source: Add New Client
de_de: Neuen Client hinzufügen
es_es: Agregar Nuevo Cliente

source: Name
es_es: Nombre

source: Client ID
es_es: ID de Cliente

source: Client Secret
de_de: Client-Geheimnis
es_es: Secreto del Cliente

source: Redirect URI
de_de: Weiterleitungs-URI
es_es: URI de Redirección

source: Created
de_de: Erstellt
es_es: Creado

source: Actions
de_de: Aktionen
es_es: Acciones

source: Regenerate Secret
de_de: Geheimnis neu generieren
es_es: Regenerar Secreto

source: Are you sure you want to delete this client?
de_de: Sind Sie sicher, dass Sie diesen Client löschen möchten?
es_es: ¿Está seguro de que desea eliminar este cliente?

source: Delete
de_de: Löschen
es_es: Eliminar

source: Add New OAuth2 Client
de_de: Neuen OAuth2-Client hinzufügen
es_es: Agregar Nuevo Cliente OAuth2

source: Client Name
es_es: Nombre del Cliente

source: A descriptive name for this client application.
de_de: Ein beschreibender Name für diese Client-Anwendung.
es_es: Un nombre descriptivo para esta aplicación cliente.

source: The callback URL where users will be redirected after authorization.
de_de: Die Callback-URL, zu der Benutzer nach der Autorisierung weitergeleitet werden.
es_es: La URL de devolución de llamada donde se redirigirá a los usuarios después de la autorización.

source: Add Client
de_de: Client hinzufügen
es_es: Agregar Cliente

source: Cancel
de_de: Abbrechen
es_es: Cancelar

source: User
de_de: Benutzer
es_es: Usuario

source: Access Token
de_de: Zugriffs-Token
es_es: Token de Acceso

source: Expires
de_de: Läuft ab
es_es: Expira

source: Active
de_de: Aktiv
es_es: Activo

source: Expired
de_de: Abgelaufen
es_es: Expirado

source: Are you sure you want to revoke this token?
de_de: Sind Sie sicher, dass Sie dieses Token widerrufen möchten?
es_es: ¿Está seguro de que desea revocar este token?

source: Revoke
de_de: Widerrufen
es_es: Revocar

source: Webhook settings have been saved successfully.
de_de: Die Webhook-Einstellungen wurden erfolgreich gespeichert.
es_es: La configuración de webhooks se ha guardado correctamente.

source: Order Webhook URL
de_de: Bestell-Webhook-URL
es_es: URL de Webhook de Pedidos

source: https://your-webhook-endpoint.com/webhook
de_de: https://ihr-webhook-endpunkt.com/webhook
es_es: https://su-endpoint-webhook.com/webhook

source: Enter the webhook URL where order completion notifications will be sent. The webhook will receive a POST request with order and user data.
de_de: Geben Sie die Webhook-URL ein, an die Benachrichtigungen über abgeschlossene Bestellungen gesendet werden. Der Webhook erhält eine POST-Anfrage mit Bestell- und Benutzerdaten.
es_es: Ingrese la URL del webhook donde se enviarán las notificaciones de finalización de pedidos. El webhook recibirá una solicitud POST con datos del pedido y del usuario.

source: User Webhook URL
de_de: Benutzer-Webhook-URL
es_es: URL de Webhook de Usuario

source: Enter the webhook URL where User Profile and roles notifications will be sent. The webhook will receive a POST request with user data and associated roles.
de_de: Geben Sie die Webhook-URL ein, an die Benachrichtigungen über Benutzerprofile und Rollen gesendet werden. Der Webhook erhält eine POST-Anfrage mit Benutzerdaten und zugeordneten Rollen.
es_es: Ingrese la URL del webhook donde se enviarán las notificaciones de perfil de usuario y roles. El webhook recibirá una solicitud POST con datos del usuario y roles asociados.

source: Save Settings
de_de: Einstellungen speichern
es_es: Guardar Configuración

source: Missing required parameters
de_de: Erforderliche Parameter fehlen
es_es: Faltan parámetros requeridos

source: Only authorization code flow is supported
de_de: Nur der Autorisierungscode-Flow wird unterstützt
es_es: Solo se admite el flujo de código de autorización

source: Invalid client
de_de: Ungültiger Client
es_es: Cliente inválido

source: Invalid redirect URI
de_de: Ungültige Weiterleitungs-URI
es_es: URI de redirección inválida

source: Invalid client credentials
de_de: Ungültige Client-Anmeldedaten
es_es: Credenciales de cliente inválidas

source: Unsupported grant type
de_de: Nicht unterstützter Gewährungstyp
es_es: Tipo de concesión no admitido

source: Invalid authorization code
de_de: Ungültiger Autorisierungscode
es_es: Código de autorización inválido

source: Missing refresh token
de_de: Aktualisierungs-Token fehlt
es_es: Falta el token de actualización

source: Invalid refresh token
de_de: Ungültiges Aktualisierungs-Token
es_es: Token de actualización inválido

source: Missing access token
de_de: Zugriffs-Token fehlt
es_es: Falta el token de acceso

source: Invalid access token
de_de: Ungültiges Zugriffs-Token
es_es: Token de acceso inválido

source: User not found
de_de: Benutzer nicht gefunden
es_es: Usuario no encontrado

source: Client ID mismatch
de_de: Client-ID stimmt nicht überein
es_es: El ID de cliente no coincide

source: Invalid post_logout_redirect_uri
de_de: Ungültige Weiterleitungs-URI nach Abmeldung
es_es: URI de redirección después del cierre de sesión inválida

source: Failed to generate authorization code
de_de: Autorisierungscode konnte nicht generiert werden
es_es: Error al generar el código de autorización

source: OAuth2 Error
de_de: OAuth2-Fehler
es_es: Error de OAuth2

source: Successfully logged out
de_de: Erfolgreich abgemeldet
es_es: Sesión cerrada correctamente
